# DATA CLEANING PANDAS

### Submitted by: Pawan Kumar (pavan11896@gmail.com)

In [1]:
import pandas as pd
import numpy as np

#### Q1. It happens all the time: someone gives you data containing malformed strings,
#### Python, lists and missing data. How do you tidy it up so you can get on with the
#### analysis?

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
# Replacing na values:
df.fillna(value=10055,limit=1,inplace=True)
df.fillna(value=10055,limit=1,inplace=True)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10055.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [5]:
#casting dtype of FlightNumber column:

df["FlightNumber"] = df["FlightNumber"].apply(lambda x : int(x))

In [6]:
df.dtypes

From_To         object
FlightNumber     int64
RecentDelays    object
Airline         object
dtype: object

#### 2. The From_To column would be better as two separate columns! Split each
#### string on the underscore delimiter _ to give a new temporary DataFrame with
#### the correct values. Assign the correct column names to this temporary
#### DataFrame.

In [7]:
def from_to(x):
    res = x.split("_")
    return res

In [8]:
df["From_To"] = df["From_To"].apply(from_to)

In [9]:
temp_df1 = df["From_To"].apply(lambda x : x[0])
df1 = pd.DataFrame(temp_df1)

In [10]:
temp_df2 = df["From_To"].apply(lambda x : x[1])
df2 = pd.DataFrame(temp_df2)

In [11]:
df

               From_To  FlightNumber  RecentDelays              Airline
0      [LoNDon, paris]         10045      [23, 47]               KLM(!)
1      [MAdrid, miLAN]         10055            []    <Air France> (12)
2  [londON, StockhOlm]         10065  [24, 43, 87]  (British Airways. )
3    [Budapest, PaRis]         10055          [13]       12. Air France
4   [Brussels, londOn]         10085      [67, 32]          "Swiss Air"

#### 3.Notice how the capitalisation of the city names is all mixed up in this
#### temporary DataFrame. Standardise the strings so that only the first letter is
#### uppercase (e.g. "londON" should become "London".)

In [12]:
df1["From"] = df1["From_To"].apply(lambda x: x.capitalize())
df1.drop(columns=["From_To"],inplace=True)
df2["To"] = df2["From_To"].apply(lambda x: x.capitalize())
df2.drop(columns=["From_To"],inplace=True)

In [13]:
df1

       From
0    London
1    Madrid
2    London
3  Budapest
4  Brussels

In [14]:
df2

          To
0      Paris
1      Milan
2  Stockholm
3      Paris
4     London

In [15]:
df.drop(columns=["From_To"],inplace=True)

In [16]:
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10055          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [17]:
df1

       From
0    London
1    Madrid
2    London
3  Budapest
4  Brussels

In [18]:
df2

          To
0      Paris
1      Milan
2  Stockholm
3      Paris
4     London

In [19]:
temporary_dataframe = df1.join(df2)

In [20]:
temporary_dataframe

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [21]:
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10055          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

#### 4. Delete the From_To column from df and attach the temporary DataFrame
#### from the previous questions.

In [22]:
df = df.join(temporary_dataframe)
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10055          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

#### 5. In the RecentDelays column, the values have been entered into the
#### DataFrame as a list. We would like each first value in its own column, each
#### second value in its own column, and so on. If there isn't an Nth value, the value
#### should be NaN.
#### Expand the Series of lists into a DataFrame named delays, rename the columns
#### delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
#### with delays.

In [23]:
def delay(x):
    if len(x) > 0:
        return x[0]
    else:
        return np.nan

def delay1(x):
    if len(x) > 1:
        return x[1]
    else:
        return np.nan

def delay2(x):
    if len(x) > 2:
        return x[2]
    else:
        return np.nan

In [24]:
df['delay_1'] = df['RecentDelays'].apply(delay)

In [25]:
df['delay_2'] = df['RecentDelays'].apply(delay1)

In [26]:
df['delay_3'] = df['RecentDelays'].apply(delay2)

In [27]:
df

,FlightNumber,RecentDelays,Airline,From,To,delay_1,delay_2,delay_3
0,10045,"[23, 47]",KLM(!),London,Paris,23.0,47.0,NaN
1,10055,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10055,[13],12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,67.0,32.0,NaN

In [28]:
df.drop("RecentDelays",axis=1,inplace=True)

In [29]:
df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10055,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN

##### rearranging columns to make the dataframe more organised:

In [30]:
cols = df.columns.to_list()

In [31]:
cols

['FlightNumber', 'Airline', 'From', 'To', 'delay_1', 'delay_2', 'delay_3']

In [32]:
cols_rearranged = ['FlightNumber','From','To','Airline','delay_1','delay_2','delay_3']

In [33]:
df_final = df[cols]

In [34]:
df_final

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10055,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN